results/4-loadtest/aws_results/aws_go_800.txt
Running 1m test @ https://zz5urfwt50.execute-api.eu-central-1.amazonaws.com/test/go_matrix
  2 threads and 800 connections
  Thread calibration: mean lat.: 225.775ms, rate sampling interval: 1838ms
  Thread calibration: mean lat.: 241.742ms, rate sampling interval: 1906ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.78ms   18.20ms 320.26ms   91.98%
    Req/Sec   400.78     30.15   419.00     88.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   43.49ms
 75.000%   50.75ms
 90.000%   61.34ms
 99.000%  104.19ms
 99.900%  273.92ms
 99.990%  320.00ms
 99.999%  320.51ms
100.000%  320.51ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      26.463     0.000000            1         1.00
      31.807     0.100000         3855         1.11
      33.407     0.200000         7716         1.25
      35.583     0.300000        11558         1.43
      39.167     0.400000        15368         1.67
      43.487     0.500000        19230         2.00
      44.671     0.550000        21153         2.22
      45.855     0.600000        23046         2.50
      47.135     0.650000        24963         2.86
      48.671     0.700000        26896         3.33
      50.751     0.750000        28827         4.00
      51.871     0.775000        29770         4.44
      53.183     0.800000        30729         5.00
      54.847     0.825000        31680         5.71
      57.119     0.850000        32636         6.67
      59.007     0.875000        33598         8.00
      60.159     0.887500        34084         8.89
      61.343     0.900000        34556        10.00
      62.911     0.912500        35038        11.43
      64.895     0.925000        35518        13.33
      68.031     0.937500        35995        16.00
      71.039     0.943750        36235        17.78
      73.215     0.950000        36476        20.00
      74.751     0.956250        36714        22.86
      76.735     0.962500        36957        26.67
      79.295     0.968750        37198        32.00
      81.279     0.971875        37317        35.56
      84.543     0.975000        37434        40.00
      88.767     0.978125        37556        45.71
      91.071     0.981250        37675        53.33
      94.207     0.984375        37794        64.00
      96.575     0.985938        37854        71.11
      98.751     0.987500        37916        80.00
     102.335     0.989062        37974        91.43
     105.023     0.990625        38038       106.67
     107.135     0.992188        38094       128.00
     108.479     0.992969        38124       142.22
     110.527     0.993750        38154       160.00
     112.767     0.994531        38184       182.86
     117.887     0.995313        38214       213.33
     122.623     0.996094        38244       256.00
     125.759     0.996484        38259       284.44
     141.055     0.996875        38274       320.00
     185.855     0.997266        38289       365.71
     252.159     0.997656        38304       426.67
     258.943     0.998047        38319       512.00
     260.479     0.998242        38326       568.89
     265.471     0.998437        38334       640.00
     268.543     0.998633        38341       731.43
     270.847     0.998828        38349       853.33
     274.943     0.999023        38356      1024.00
     276.223     0.999121        38361      1137.78
     279.295     0.999219        38364      1280.00
     280.319     0.999316        38367      1462.86
     282.367     0.999414        38374      1706.67
     284.415     0.999512        38375      2048.00
     285.695     0.999561        38377      2275.56
     286.975     0.999609        38380      2560.00
     286.975     0.999658        38380      2925.71
     289.279     0.999707        38382      3413.33
     291.583     0.999756        38384      4096.00
     294.143     0.999780        38385      4551.11
     296.703     0.999805        38386      5120.00
     317.951     0.999829        38387      5851.43
     318.207     0.999854        38388      6826.67
     319.999     0.999878        38389      8192.00
     319.999     0.999890        38389      9102.22
     320.255     0.999902        38392     10240.00
     320.255     0.999915        38392     11702.86
     320.255     0.999927        38392     13653.33
     320.255     0.999939        38392     16384.00
     320.255     0.999945        38392     18204.44
     320.255     0.999951        38392     20480.00
     320.255     0.999957        38392     23405.71
     320.255     0.999963        38392     27306.67
     320.255     0.999969        38392     32768.00
     320.255     0.999973        38392     36408.89
     320.511     0.999976        38393     40960.00
     320.511     1.000000        38393          inf
#[Mean    =       45.783, StdDeviation   =       18.199]
#[Max     =      320.256, Total count    =        38393]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  47183 requests in 1.00m, 25.15MB read
Requests/sec:    786.22
Transfer/sec:    429.20KB