results/4-loadtest/aws_results/aws_node_1000.txt
Running 1m test @ https://4wr6wy8fnf.execute-api.eu-central-1.amazonaws.com/test/node_matrix
  2 threads and 1000 connections
  Thread calibration: mean lat.: 315.107ms, rate sampling interval: 2238ms
  Thread calibration: mean lat.: 238.052ms, rate sampling interval: 1515ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    52.59ms   29.68ms 632.32ms   96.46%
    Req/Sec   499.77     61.39   644.00     65.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   47.68ms
 75.000%   56.00ms
 90.000%   65.73ms
 99.000%  149.38ms
 99.900%  531.97ms
 99.990%  605.18ms
 99.999%  632.83ms
100.000%  632.83ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      32.991     0.000000            1         1.00
      38.591     0.100000         4766         1.11
      40.095     0.200000         9446         1.25
      41.727     0.300000        14216         1.43
      43.903     0.400000        18881         1.67
      47.679     0.500000        23617         2.00
      49.823     0.550000        25987         2.22
      51.423     0.600000        28342         2.50
      52.831     0.650000        30713         2.86
      54.271     0.700000        33067         3.33
      55.999     0.750000        35411         4.00
      57.151     0.775000        36602         4.44
      58.623     0.800000        37778         5.00
      60.191     0.825000        38946         5.71
      61.759     0.850000        40132         6.67
      63.423     0.875000        41318         8.00
      64.415     0.887500        41902         8.89
      65.727     0.900000        42500        10.00
      67.199     0.912500        43082        11.43
      69.183     0.925000        43664        13.33
      72.319     0.937500        44257        16.00
      74.239     0.943750        44551        17.78
      76.543     0.950000        44843        20.00
      78.719     0.956250        45142        22.86
      81.215     0.962500        45433        26.67
      85.055     0.968750        45727        32.00
      88.319     0.971875        45875        35.56
      91.263     0.975000        46022        40.00
      94.463     0.978125        46172        45.71
     101.439     0.981250        46317        53.33
     111.487     0.984375        46465        64.00
     116.927     0.985938        46539        71.11
     125.247     0.987500        46613        80.00
     138.239     0.989062        46686        91.43
     152.191     0.990625        46762       106.67
     160.895     0.992188        46836       128.00
     171.903     0.992969        46871       142.22
     185.599     0.993750        46907       160.00
     203.775     0.994531        46945       182.86
     219.135     0.995313        46981       213.33
     224.767     0.996094        47018       256.00
     260.735     0.996484        47037       284.44
     297.471     0.996875        47055       320.00
     353.023     0.997266        47073       365.71
     404.479     0.997656        47092       426.67
     451.583     0.998047        47110       512.00
     483.327     0.998242        47120       568.89
     498.943     0.998437        47129       640.00
     513.023     0.998633        47138       731.43
     520.447     0.998828        47147       853.33
     531.967     0.999023        47158      1024.00
     533.503     0.999121        47161      1137.78
     543.231     0.999219        47167      1280.00
     546.815     0.999316        47170      1462.86
     548.351     0.999414        47175      1706.67
     553.983     0.999512        47180      2048.00
     558.591     0.999561        47183      2275.56
     559.103     0.999609        47184      2560.00
     560.639     0.999658        47186      2925.71
     562.687     0.999707        47189      3413.33
     577.535     0.999756        47191      4096.00
     578.047     0.999780        47192      4551.11
     578.559     0.999805        47193      5120.00
     580.095     0.999829        47194      5851.43
     592.895     0.999854        47196      6826.67
     605.183     0.999878        47197      8192.00
     605.183     0.999890        47197      9102.22
     606.719     0.999902        47198     10240.00
     606.719     0.999915        47198     11702.86
     609.791     0.999927        47199     13653.33
     612.351     0.999939        47200     16384.00
     612.351     0.999945        47200     18204.44
     612.351     0.999951        47200     20480.00
     612.351     0.999957        47200     23405.71
     615.935     0.999963        47201     27306.67
     615.935     0.999969        47201     32768.00
     615.935     0.999973        47201     36408.89
     615.935     0.999976        47201     40960.00
     615.935     0.999979        47201     46811.43
     632.831     0.999982        47202     54613.33
     632.831     1.000000        47202          inf
#[Mean    =       52.591, StdDeviation   =       29.679]
#[Max     =      632.320, Total count    =        47202]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58765 requests in 1.00m, 30.54MB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:    979.15
Transfer/sec:    521.13KB