results/4-loadtest/aws_results/aws_node_2000.txt
Running 1m test @ https://4wr6wy8fnf.execute-api.eu-central-1.amazonaws.com/test/node_matrix
  2 threads and 2000 connections
  Thread calibration: mean lat.: 157.988ms, rate sampling interval: 868ms
  Thread calibration: mean lat.: 152.692ms, rate sampling interval: 726ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    91.49ms  165.40ms   1.52s    95.85%
    Req/Sec   509.01    108.12     0.98k    83.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   53.60ms
 75.000%   72.38ms
 90.000%  105.41ms
 99.000%    1.12s 
 99.900%    1.46s 
 99.990%    1.51s 
 99.999%    1.52s 
100.000%    1.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      33.535     0.000000            1         1.00
      40.159     0.100000         4528         1.11
      42.367     0.200000         9052         1.25
      44.607     0.300000        13546         1.43
      48.639     0.400000        18053         1.67
      53.599     0.500000        22563         2.00
      55.551     0.550000        24838         2.22
      57.695     0.600000        27081         2.50
      60.671     0.650000        29324         2.86
      65.407     0.700000        31585         3.33
      72.383     0.750000        33837         4.00
      76.223     0.775000        34970         4.44
      80.703     0.800000        36098         5.00
      86.143     0.825000        37219         5.71
      91.007     0.850000        38346         6.67
      96.575     0.875000        39476         8.00
     100.799     0.887500        40039         8.89
     105.407     0.900000        40600        10.00
     112.511     0.912500        41164        11.43
     125.823     0.925000        41731        13.33
     147.327     0.937500        42292        16.00
     159.103     0.943750        42577        17.78
     185.855     0.950000        42856        20.00
     211.583     0.956250        43138        22.86
     347.135     0.962500        43420        26.67
     512.767     0.968750        43702        32.00
     561.151     0.971875        43843        35.56
     604.159     0.975000        43984        40.00
     666.623     0.978125        44125        45.71
     809.471     0.981250        44267        53.33
     971.775     0.984375        44407        64.00
    1038.847     0.985938        44477        71.11
    1103.871     0.987500        44550        80.00
    1114.111     0.989062        44620        91.43
    1121.279     0.990625        44695       106.67
    1128.447     0.992188        44764       128.00
    1131.519     0.992969        44794       142.22
    1163.263     0.993750        44830       160.00
    1208.319     0.994531        44865       182.86
    1248.255     0.995313        44900       213.33
    1291.263     0.996094        44935       256.00
    1317.887     0.996484        44953       284.44
    1340.415     0.996875        44971       320.00
    1360.895     0.997266        44988       365.71
    1385.471     0.997656        45006       426.67
    1405.951     0.998047        45023       512.00
    1417.215     0.998242        45032       568.89
    1430.527     0.998437        45042       640.00
    1436.671     0.998633        45051       731.43
    1452.031     0.998828        45059       853.33
    1461.247     0.999023        45067      1024.00
    1466.367     0.999121        45072      1137.78
    1472.511     0.999219        45077      1280.00
    1478.655     0.999316        45081      1462.86
    1485.823     0.999414        45085      1706.67
    1490.943     0.999512        45090      2048.00
    1492.991     0.999561        45092      2275.56
    1497.087     0.999609        45095      2560.00
    1499.135     0.999658        45096      2925.71
    1501.183     0.999707        45098      3413.33
    1502.207     0.999756        45100      4096.00
    1507.327     0.999780        45103      4551.11
    1507.327     0.999805        45103      5120.00
    1508.351     0.999829        45104      5851.43
    1512.447     0.999854        45106      6826.67
    1512.447     0.999878        45106      8192.00
    1513.471     0.999890        45107      9102.22
    1513.471     0.999902        45107     10240.00
    1514.495     0.999915        45108     11702.86
    1514.495     0.999927        45108     13653.33
    1517.567     0.999939        45109     16384.00
    1517.567     0.999945        45109     18204.44
    1517.567     0.999951        45109     20480.00
    1518.591     0.999957        45110     23405.71
    1518.591     0.999963        45110     27306.67
    1518.591     0.999969        45110     32768.00
    1518.591     0.999973        45110     36408.89
    1518.591     0.999976        45110     40960.00
    1523.711     0.999979        45111     46811.43
    1523.711     1.000000        45111          inf
#[Mean    =       91.486, StdDeviation   =      165.397]
#[Max     =     1522.688, Total count    =        45111]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59504 requests in 1.00m, 30.93MB read
  Socket errors: connect 983, read 0, write 0, timeout 26541
Requests/sec:    991.69
Transfer/sec:    527.80KB